In [57]:
import pandas as pd
import numpy as np

In [58]:
#import dataset
data = pd.read_csv('../../csvs/multivariate_linear_regression_raw_data.csv', header = None)
#columns are labeled as i1 (independent variable 1), i2 (independent variable 2), d (dependent variable)
data.columns = ['i1', 'i2', 'd']
#initialize a new column to represent the starting point for the bias term (intercept value)
# data['b'] = 1
#alternate way of adding this column
data = pd.concat([pd.Series(1, index=data.index, name='b'), data], axis=1)
print(f"There are {len(data.index)} rows in the dataset!")
data.head()

There are 47 rows in the dataset!

   b    i1  i2       d
0  1  2104   3  399900
1  1  1600   3  329900
2  1  2400   3  369000
3  1  1416   2  232000
4  1  3000   4  539900

In [59]:
#define independent variables: i1, i2, bias term
X = data.drop(columns='d')
# X.head()

#define dependent variable: d
Y = data.iloc[:, 3]
# Y.head()

In [60]:
print(len(data.index))
print(len(data.columns))

47
4

In [61]:
X.head()

   b    i1  i2
0  1  2104   3
1  1  1600   3
2  1  2400   3
3  1  1416   2
4  1  3000   4

In [65]:
#Since there is more than one independent variable, it is necessary to normalize the independent variable
for i in X.index:
    print()
    X.loc[i, 'i1'] = X.i1[i]/np.max(X.i1)
    X.loc[i, 'i2'] = X.i2[i]/np.max(X.i2)

X.head()
# #alternate way of doing this if columns are named 0, 1, 2, etc.
# for i in range(1, len(X.columns)):
#     X[i-1] = X[i-1]/np.max(X[i-1])

   b        i1   i2
0  1  0.469853  0.6
1  1  0.357302  0.6
2  1  0.535954  0.6
3  1  0.316213  0.4
4  1  0.669942  0.8